type Sequence = {
	name?: string,
}
type Pathway = {
	sequences: Sequence[]
}
type OldOne = {
	name: string,
	class?: string,
	pathways: Pathway[]
}


export const oldOnes: OldOne[] = [
	{
		name: "Бог Всемогутній",
		class: "text-amber-500",
		pathways: [
			{
				sequences: [
					{
						name: "Бард",
					},
					{
						name: "Жрець Світла",
					},
					{
						name: "Наставник Честі",
					},
					{
						name: "Священник Світла",
					},
					{
						name: "Незатемнений",
					},
					{
						name: "Білий Лицар",
					},
					{
						name: "Сяючий Чародій",
					},
					{
						name: "Золотий Ангел"
					},
					{
						name: "Архієпископ Сонця",
					},
					{
						name: "Сонце",
					},
				],
			},
			{
				sequences: [
					{
						name: "Воїн",
					},
					{
						name: "Борець",
					},
					{
						name: "Майстер Бою",
					},
					{
						name: "Полковник",
					},
					{
						name: "Кровавий Паладин",
					},
					{
						name: "Лицар Слави",
					},
					{
						name: "Невгамонний Вождь"
					},
					{
						name: "Титан"
					},
					{
						name: "Руйнівник"
					},
					{
						name: "Алмазний Гігант",
					},
				],
			},
			{
				sequences: [
					{
						name: "Глядач",
					},
					{
						name: "Телепат",
					},
					{
						name: "Психіатр",
					},
					{
						name: "Майстер Гіпнозу",
					},
					{
						name: "Провидець Розуму",
					},
					{
						name: "Маніпулятор",
					},
					{
						name: "Творець Мрій",
					},
					{
						name: "Сірий Ангел",
					},
					{
						name: "Ткач долі",
					},
					{
						name: "Візіонер",
					},
				],
			},
			{
				sequences: [
					{
						name: "Читач",
					},
					{
						name: "Аналітик",
					},
					{
						name: "Слідчий",
					},
					{
						name: "Детектив",
					},
					{
						name: "Проти Саботажник",
					},
					{
						name: "Професор",
					},
					{
						name: "Знаток Містики",
					},
					{
						name: "Ангел Знань",
					},
					{
						name: "Всезнаючий",
					},
					{
						name: "Мудрець Шляхів",
					},
				],
			},
		],
	},
	{
		name: "Володар Таємниць",
		class: "text-violet-500",
		pathways: [
			{
				sequences: [
					{
						name: "Провидець",
					},
					{
						name: "Клоун",
					},
					{
						name: "Фокусник",
					},
					{
						name: "Безликий",
					},
					{
						name: "Маріонетник",
					},
					{
						name: "Джокер",
					},
					{
						name: "Знаток Минулого",
					},
					{
						name: "Чудотворець",
					},
					{
						name: "Таємниця",
					},
					{
						name: "Шут",
					},
				],
			},
			{
				sequences: [
					{
						name: "Асасин",
					},
					{
						name: "Імітатор",
					},
					{
						name: "Шпигун",
					},
					{
						name: "Колюча Троянда",
					},
					{
						name: "Невидимка",
					},
					{
						name: "Туманний Лицар",
					},
					{
						name: "Фантом",
					},
					{
						name: "Хранитель Секретів",
					},
					{
						name: "Лорд Тіней",
					},
					{
						name: "Міраж",
					},
				],
			},
			{
				sequences: [
					{
						name: "Мародер",
					},
					{
						name: "Шахрай",
					},
					{
						name: "Криптолог",
					},
					{
						name: "Загарбник",
					},
					{
						name: "Чорний Менталіст",
					},
					{
						name: "Паразит",
					},
					{
						name: "Дух Фальші",
					},
					{
						name: "Богохульник Судьби",
					},
					{
						name: "Безумний Розбійник",
					},
					{
						name: "Баг",
					},
				],
			},
		],
	},
	{
		name: "Вічний Дракон",
		class: "text-blue-500",
		pathways: [
			{
				sequences: [
					{
						name: "Чародій",
					},
					{
						name: "Штормовий Маг",
					},
					{
						name: "Кастер",
					},
					{
						name: "Гнів",
},
					{
						name: "Маг Символів",
},
					{
						name: "Магістр Штурму",
},
					{
						name: "Дракон",
},
					{
						name: "Ангел Лиха",
},
					{
						name: "Армагедон",
},
					{
						name: "Сутінковий Дракон",
					},
				],
			},
			{
				sequences: [
					{
						name: "Безсонний",
					},
					{
						name: "Нічна Пісня",
					},
					{
						name: "Провідник Сну",
					},
					{
						name: "Лансер",
},
					{
						name: "Астроном",
},
					{
						name: "Нічний Дозор",
},
					{
						name: "Мисливець за Легендами",
},
					{
						name: "Темний Ангел",
},
					{
						name: "Зоряний Архімаг",
},
					{
						name: "Темрява",
					},
				],
			},
			{
				sequences: [
					{
						name: "Збирач Трупів",
					},
					{
						name: "Костяний Жрець",
					},
					{
						name: "Проклятий",
					},
					{
						name: "Некромант",
},
					{
						name: "Осквернитель",
},
					{
						name: "Лицар Смерті",
},
					{
						name: "Невмираючий Король",
},
					{
						name: "Ангел Нещастя",
},
					{
						name: "Ліч Помсти",
},
					{
						name: "Смерть",
					},
				],
			},
		],
	},
	{
		name: "Власник Світу",
		class: "text-teal-500",
		pathways: [
			{
				sequences: [
					{
						name: "Будівник",
					},
					{
						name: "Дослідник Глибин",
					},
					{
						name: "Майстер Руїн",
					},
					{
						name: "Жадний Шахтар",
					},
					{
						name: "Проникаючий",
					},
					{
						name: "Чорний Лицар",
					},
					{
						name: "Лорд Підземелля",
},
					{
						name: "Землетрус",
},
					{
						name: "Герой Каньйону",
},
					{
						name: "Печерний Імператор",
					},
				],
			},
			{
				sequences: [
					{
						name: "Матрос",
					},
					{
						name: "Пірат",
					},
					{
						name: "Мореплавець",
					},
					{
						name: "Сейбер",
},
					{
						name: "Хвиля",
},
					{
						name: "Лазурний Жнець",
},
					{
						name: "Морський Король",
},
					{
						name: "Буря",
},
					{
						name: "Катастрофа",
},
					{
						name: "Тиран",
					},
				],
			},
		],
	},
	{
		name: "Фенікс Стихій",
		class: "text-lime-500",
		pathways: [
			{
				sequences: [
					{
						name: "Елементаліст",
					},
					{
						name: "Поет",
					},
					{
						name: "Майстер Стихій",
					},
					{
						name: "Творець Свого Щастя",
},
					{
						name: "Алхімік",
},
					{
						name: "Призивач",
},
					{
						name: "Еволюціонер",
},
					{
						name: "Прироний Шедевр",
},
					{
						name: "Райдужний Архімаг",
},
					{
						name: "Кільце Стихій",
					},
				],
			},
			{
				sequences: [
					{
						name: "Прохач Духів",
					},
					{
						name: "Виробник Зілля",
					},
					{
						name: "Майстер Печаті",
					},
					{
						name: "Шаман",
},
					{
						name: "Духовний Медіум",
},
					{
						name: "Друїд",
},
					{
						name: "Король Духів",
},
					{
						name: "Ангел Життя",
},
					{
						name: "Незгасаюча Птиця",
},
					{
						name: "Безсмертний Дух",
					},
				],
			},
		],
	},
	{
		name: "Закон",
		class: "text-orange-500",
		pathways: [
			{
				sequences: [
					{
						name: "Ученик",
					},
					{
						name: "Шукач",
					},
					{
						name: "Майстер Гримуарів",
					},
					{
						name: "Оцінювач",
},
					{
						name: "Хімік",
},
					{
						name: "Аркан Маг",
},
					{
						name: "Містик",
},
					{
						name: "Ясновидець",
},
					{
						name: "Ключ Зірок",
},
					{
						name: "Відлюдник",
					},
				],
			},
			{
				sequences: [
					{
						name: "Науковець",
					},
					{
						name: "Механік",
					},
					{
						name: "Відкривач",
					},
					{
						name: "Ремісник",
					},
					{
						name: "Фізик",
},
					{
						name: "Артефактор",
},
					{
						name: "Залізний Король",
},
					{
						name: "Робот",
},
					{
						name: "Божествений Коваль",
},
					{
						name: "Процесор",
					},
				],
			},
		],
	},
	{
		name: "Дволикій",
		class: "text-red-500",
		pathways: [
			{
				sequences: [
					{
						name: "Мисливець",
					},
					{
						name: "Провокатор",
					},
					{
						name: "Піромант",
					},
					{
						name: "Змовник",
},
					{
						name: "Бунтар",
},
					{
						name: "Лицар Війни",
},
					{
						name: "Вісник",
},
					{
						name: "Кровавий Ангел",
},
					{
						name: "Завойовник",
},
					{
						name: "Червона Колесниця",
					},
				],
			},
			{
				sequences: [
					{
						name: "Прихований",
					},
					{
						name: "Підбурювач",
					},
					{
						name: "Відьма",
					},
					{
						name: "Насолода",
},
					{
						name: "Страждання",
},
					{
						name: "Відчай",
},
					{
						name: "Руйнівник Особи",
},
					{
						name: "Чума",
},
					{
						name: "Апокаліпсис",
},
					{
						name: "Пандемонія",
					},
				],
			},
		],
	},
	{
		name: "Кінець",
		class: "text-pink-500",
		pathways: [
			{
				sequences: [
					{
						name: "Бродяга",
					},
					{
						name: "Мандрівник",
					},
					{
						name: "Везунчик",
					},
					{
						name: "Азартний Гравець",
},
					{
						name: "Переможець",
},
					{
						name: "Пророк",
},
					{
						name: "Непередбачуваний",
},
					{
						name: "Рука Бога",
},
					{
						name: "Змій Меркурія",
},
					{
						name: "Колесо Удачі",
					},
				],
			},
		],
	},
	//  {
	// 	name: "Пробуджений Хаос",
	// 	class: "text-green-500",
	// 	pathways: [
	// 		{
	// 			sequences: [
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "Закутий",
	// 				},
	// 			],
	// 		},
	// 		{
	// 			sequences: [
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "Губитель",
	// 				},
	// 				{
	// 					name: "Повішаний",
	// 				},
	// 			],
	// 		},
	// 	],
	// },
	// {
	// 	name: "Рай",
	// 	class: "text-emerald-500",
	// 	pathways: [
	// 		{
	// 			sequences: [
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "Небесні Ворота",
	// 				},
	// 			],
	// 		},
	// 		{
	// 			sequences: [
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "Блаженство",
	// 				},
	// 			],
	// 		},
	// 	],
	// },
	// {
	// 	name: "Пекло",
	// 	class: "text-fuchsia-500",
	// 	pathways: [
	// 		{
	// 			sequences: [
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "Безодня",
	// 				},
	// 			],
	// 		},
	// 		{
	// 			sequences: [
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "",
	// 				},
	// 				{
	// 					name: "Дикий Вогонь",
	// 				},
	// 			],
	// 		},
	// 	],
	// },
	{
		name: "Новий Світ",
		class: "text-stone-500",
		pathways: [
			{
				sequences: [
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
				],
			},
		],
	},
	{
		name: "Стимулятор Зірок",
		class: "text-emerald-500",
		pathways: [
			{
				sequences: [
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "Кровавік",
					},
				],
			},
			{
				sequences: [
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "",
					},
					{
						name: "Балдер",
					},
				],
			},
		],
	},
];
